In [179]:
import pandas as pd
import numpy as np

In [135]:
np.random.rand()

0.5742751174903048

In [180]:
s1=pd.Series(np.random.rand(10),dtype=float)
print(s1,type(s1))

0    0.810449
1    0.161521
2    0.384540
3    0.597165
4    0.559761
5    0.493669
6    0.544570
7    0.577325
8    0.390671
9    0.323259
dtype: float64 <class 'pandas.core.series.Series'>

## create a data frame with randomly generated contents of a column having 9 random values and second column is double of the first one

In [181]:
s=np.random.rand(9)
print(s,type(s))
s*100

[0.11027552 0.14066158 0.14287393 0.59920327 0.79802555 0.86148212
 0.79943133 0.02935362 0.92654932] <class 'numpy.ndarray'>

array([11.02755165, 14.06615754, 14.28739257, 59.92032733, 79.8025554 ,
       86.14821219, 79.94313331,  2.9353622 , 92.65493238])

In [138]:
frame = pd.DataFrame(s,  columns=['first'])
display(frame)
frame['second']=frame['first']*2
display(frame)

      first
0  0.973959
1  0.186089
2  0.868268
3  0.456204
4  0.635983
5  0.526179
6  0.817277
7  0.184618
8  0.637971

      first    second
0  0.973959  1.947919
1  0.186089  0.372179
2  0.868268  1.736535
3  0.456204  0.912408
4  0.635983  1.271966
5  0.526179  1.052359
6  0.817277  1.634553
7  0.184618  0.369236
8  0.637971  1.275941

## find the output?

In [182]:
frame1 = pd.DataFrame(s.reshape((3, 3)), index=['2001', '2002', '2003'], columns=['Ohio', 'Texas', 'California'])
print(frame1)

          Ohio     Texas  California
2001  0.110276  0.140662    0.142874
2002  0.599203  0.798026    0.861482
2003  0.799431  0.029354    0.926549

# reindexing uses outer join

In [6]:
frame2 = frame1.reindex(['2001', '2002', '2004', '2005'])
print(frame2)

          Ohio     Texas  California
2001  0.165508  0.239298    0.777634
2002  0.878589  0.600164    0.521871
2004       NaN       NaN         NaN
2005       NaN       NaN         NaN

In [7]:
frame2.index.is_unique

True

## row labels/index labels may be duplicated. Note reindex() needs unique labels

In [8]:
frame2.loc[2004]=[11,12,13]

In [9]:
frame2

           Ohio      Texas  California
2001   0.165508   0.239298    0.777634
2002   0.878589   0.600164    0.521871
2004        NaN        NaN         NaN
2005        NaN        NaN         NaN
2004  11.000000  12.000000   13.000000

## given a data frame with gaps in row indices

In [12]:
frame1

          Ohio     Texas  California
2001  0.165508  0.239298    0.777634
2003  0.194777  0.459092    0.060569
2005  0.453358  0.453358    0.453358
2007  0.453358  0.453358    0.453358

## instead of having NAN values on unknown row indices values from previous index is copied

In [11]:
frame1=frame1.reindex(['2001', '2003', '2005', '2007'],fill_value=frame1.mean().max())

In [14]:
frame1.reindex(['2001', '2003', '2005', '2007','2008'],method='ffill')

          Ohio     Texas  California
2001  0.165508  0.239298    0.777634
2003  0.194777  0.459092    0.060569
2005  0.453358  0.453358    0.453358
2007  0.453358  0.453358    0.453358
2008  0.453358  0.453358    0.453358

In [15]:
frame1

          Ohio     Texas  California
2001  0.165508  0.239298    0.777634
2003  0.194777  0.459092    0.060569
2005  0.453358  0.453358    0.453358
2007  0.453358  0.453358    0.453358

## changing row index and specific row/column label using rename

In [16]:
#frame1.index=['2001', '2002', '2003', '2004']
frame1.rename(columns={'Ohio': 'Ohio1'}, index={'2005': '2006'})

         Ohio1     Texas  California
2001  0.165508  0.239298    0.777634
2003  0.194777  0.459092    0.060569
2006  0.453358  0.453358    0.453358
2007  0.453358  0.453358    0.453358

## column reindexing

In [17]:
newcols=['Ohio','Texas','Greenfield']
frame2 = frame1.reindex(columns=newcols)

In [20]:
frame2

          Ohio     Texas  Greenfield
2001  0.165508  0.239298    0.165508
2003  0.194777  0.459092    0.194777
2005  0.453358  0.453358    0.453358
2007  0.453358  0.453358    0.453358

In [19]:
frame2['Greenfield']=frame2[['Ohio','Texas']].min(axis=1)

In [21]:
newcols=['Ohio','Texas','Greenfield1']
frame1.reindex(columns=newcols,fill_value=10)

          Ohio     Texas  Greenfield1
2001  0.165508  0.239298           10
2003  0.194777  0.459092           10
2005  0.453358  0.453358           10
2007  0.453358  0.453358           10

In [151]:
frame1['XXX']=-90

In [207]:
frame1

          Ohio     Texas  California    XXX
2001  0.973959       NaN    0.868268  -90.0
2005  0.817277  0.184618    0.637971  -90.0
2004  0.749147  0.749147    0.749147  -90.0
2004  1.498293  1.498293    1.498293 -180.0

In [ ]:
frame1.reindex(['2001', '2003', '2005', '2009'],method='ffill')

# appending rows/columns in a data frame

In [23]:
L=[21,20,20,24]

## inserting a new column at the specified location using list. size of elements in the new coulmn must match so that existing row indexes are used, duplicate columns are allowed

In [25]:
frame1.shape

(4, 3)

In [26]:
frame1.insert(2, "YYYY1", L, True)

In [27]:
frame1

          Ohio     Texas  YYYY1  California
2001  0.165508  0.239298     21    0.777634
2003  0.194777  0.459092     20    0.060569
2005  0.453358  0.453358     20    0.453358
2007  0.453358  0.453358     24    0.453358

## inserting a series as a column. Only common Indexes are (Outer join) used and the remaining indexes of the data frame are assigned None value

In [ ]:
s1=pd.Series(np.random.rand(4),dtype=float,index=['a','b','c','d'])

## duplicate column names are allowed

In [211]:
frame1.columns[2]

'California'

In [37]:
L=frame1.median(axis=1)
L

2001    0.508466
2003    0.326934
2005    0.453358
2007    3.000000
dtype: float64

## appending a row

In [41]:
L=frame1.mean()
L.name='2009'

In [42]:
frame1=frame1.append(L)

In [44]:
frame1.index[0]

'2001'

In [45]:
frame1

          Ohio     Texas  YYYY1  California
2001  0.165508  0.239298  21.00    0.777634
2003  0.194777  0.459092  20.00    0.060569
2005  0.453358  0.453358  20.00    0.453358
2007  0.000000  2.000000   4.00    6.000000
2009  0.203411  0.787937  16.25    1.822890
2009  0.203411  0.787937  16.25    1.822890

In [49]:
x=frame1.index[-1]
frame1.rename(index={frame1.index[-1]:str(int(x)+1)})

          Ohio     Texas  YYYY1  California
2001  0.165508  0.239298  21.00    0.777634
2003  0.194777  0.459092  20.00    0.060569
2005  0.453358  0.453358  20.00    0.453358
2007  0.000000  2.000000   4.00    6.000000
2010  0.203411  0.787937  16.25    1.822890
2010  0.203411  0.787937  16.25    1.822890

In [58]:
frame1

          Ohio     Texas  YYYY1  California
2001  0.165508  0.239298  21.00    0.777634
2003  0.194777  0.459092  20.00    0.060569
2005  0.453358  0.453358  20.00    0.453358
2007  0.000000  2.000000   4.00    6.000000
2009  0.203411  0.787937  16.25    1.822890
2009  0.203411  0.787937  16.25    1.822890
2010  0.203411  0.787937  16.25    1.822890

In [57]:
s1=frame1.iloc[len(frame1)-1]
s1.name=2010
frame1=frame1.append(s1)

## appending rows in data frame1. in-place change

In [29]:
frame1.loc['2007']=range(0,len(frame1.columns)*2,2)

In [30]:
frame1

          Ohio     Texas  YYYY1  California
2001  0.165508  0.239298     21    0.777634
2003  0.194777  0.459092     20    0.060569
2005  0.453358  0.453358     20    0.453358
2007  0.000000  2.000000      4    6.000000

## Find total of each column and add as last row

In [ ]:
s1=frame1.sum()
s1.name='total'

In [ ]:
frame1.append(s1)

           Ohio     Texas  YYYY  YYYY  California  YYYY1
2001   0.665617  0.524226  21.0  21.0    0.520634   21.0
2002   0.669841  0.967749  20.0  20.0    0.046615   20.0
2003   0.069833  0.964553  20.0  20.0    0.697203   20.0
g      0.000000  2.000000   4.0   6.0    8.000000   10.0
total  1.405292  4.456528  65.0  67.0    9.264452   71.0

In [31]:
frame1

          Ohio     Texas  YYYY1  California
2001  0.165508  0.239298     21    0.777634
2003  0.194777  0.459092     20    0.060569
2005  0.453358  0.453358     20    0.453358
2007  0.000000  2.000000      4    6.000000

## adding row thru appending

In [32]:
labels=frame1.columns
l=len(frame1.columns)

In [33]:
s1=pd.Series(3*np.random.rand(l),dtype=float,index=labels)
s1.name='bb'
s1

Ohio          1.456206
Texas         0.145728
YYYY1         2.902656
California    1.623052
Name: bb, dtype: float64

In [ ]:
frame

       Ohio     Texas  YYYY      YYYY  California  XXX
a  0.852185  0.356548    21  0.133621    0.075002  -90
e  0.777700  0.738180    20       NaN    0.022195  -90
c  0.570182  0.593997    20  0.539379    0.822164  -90
g  0.000000  2.000000     4  6.000000    8.000000   10

## append() does not do in-place change

In [34]:
frame1.append(s1)

          Ohio     Texas      YYYY1  California
2001  0.165508  0.239298  21.000000    0.777634
2003  0.194777  0.459092  20.000000    0.060569
2005  0.453358  0.453358  20.000000    0.453358
2007  0.000000  2.000000   4.000000    6.000000
bb    1.456206  0.145728   2.902656    1.623052

## dropping all columns with same name

In [59]:
frame1.drop("YYYY",axis=1,inplace=True)

KeyError: "['YYYY'] not found in axis"

In [60]:
frame1

          Ohio     Texas  YYYY1  California
2001  0.165508  0.239298  21.00    0.777634
2003  0.194777  0.459092  20.00    0.060569
2005  0.453358  0.453358  20.00    0.453358
2007  0.000000  2.000000   4.00    6.000000
2009  0.203411  0.787937  16.25    1.822890
2009  0.203411  0.787937  16.25    1.822890
2010  0.203411  0.787937  16.25    1.822890

## in case data series added has axis labels different from the cols label of the data frame, then new columns (extra) will be added

In [ ]:
labels=frame1.columns
l=len(frame1.columns)
s2=pd.Series(range(4))
print(l)
print(s2)

3
0    0
1    1
2    2
3    3
dtype: int64

In [ ]:
frame1.index.is_unique

True

In [ ]:
frame1.columns.is_unique

True

## error occurs in case labels are duplicate. If row index are not in series, then default indexes are used. set ignore_index=T

In [ ]:
frame1.append(s2,ignore_index=True)

       Ohio     Texas  California    0    1    2    3
0  0.748526  0.329974    0.028977  NaN  NaN  NaN  NaN
1  0.138956  0.756983    0.212087  NaN  NaN  NaN  NaN
2  0.334746  0.298074    0.041726  NaN  NaN  NaN  NaN
3       NaN       NaN         NaN  0.0  1.0  2.0  3.0

In [ ]:
frame1

          Ohio     Texas  California
2001  0.748526  0.329974    0.028977
2002  0.138956  0.756983    0.212087
2003  0.334746  0.298074    0.041726

In [ ]:
col1=frame1.columns

In [ ]:
s1=pd.Series(range(len(col1)),index=col1)
s1=s1+2

In [ ]:
s1

Ohio          2
Texas         3
California    4
dtype: int64

In [ ]:
frame1

          Ohio     Texas  California
2001  0.347521  0.261640    0.055333
2002  0.691146  0.659268    0.833502
2003  0.381511  0.381511    0.381511
2004  0.381511  0.381511    0.381511

## while appending set ignore_index=True which will set row index to default index values.
In case series has a name, then it will be label of the row

In [ ]:
frame1.append(s1,ignore_index=True)

       Ohio     Texas  California
0  0.347521  0.261640    0.055333
1  0.691146  0.659268    0.833502
2  0.381511  0.381511    0.381511
3  0.381511  0.381511    0.381511
4  2.000000  3.000000    4.000000

In [ ]:
s1.name='2010'

In [ ]:
frame1=frame1.append(s1)

In [ ]:
frame1

          Ohio     Texas  California
2001  0.347521  0.261640    0.055333
2002  0.691146  0.659268    0.833502
2003  0.381511  0.381511    0.381511
2004  0.381511  0.381511    0.381511
g1    2.000000  3.000000    4.000000

In [ ]:
frame1.iloc[len(frame1)-1,0]=10

In [ ]:
frame1

           Ohio     Texas  California
2001   0.347521  0.261640    0.055333
2002   0.691146  0.659268    0.833502
2003   0.381511  0.381511    0.381511
2004   0.381511  0.381511    0.381511
g1    10.000000  3.000000    4.000000

## dropping row with duplicate rows and keeping first row

In [ ]:
frame1

          Ohio     Texas  California  YYYY1
2001  0.665617  0.524226    0.520634     21
2002  0.669841  0.967749    0.046615     20
2003  0.069833  0.964553    0.697203     20
g     0.000000  2.000000    8.000000     10
g1    2.000000  3.000000    4.000000      5

In [ ]:
frame1.index[3]

'g1'

In [ ]:
int('2009')+1

2010

In [ ]:
L=frame1.loc[frame1.index[3]].values
frame1.loc[int(frame1.index[2])+2]=L

c:\Users\Sharanjit Kaur\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\core\indexing.py:692: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  iloc._setitem_with_indexer(indexer, value, self.name)

In [ ]:
frame1

           Ohio     Texas  California
2001   0.347521  0.261640    0.055333
2002   0.691146  0.659268    0.833502
2003   0.381511  0.381511    0.381511
g1    10.000000  3.000000    4.000000
2005  10.000000  3.000000    4.000000

In [ ]:
frame1=frame1.drop_duplicates(keep='first')

## have a new column with maximum value of states at a first position

In [ ]:
frame1.max(axis=1)

2001     0.347521
2002     0.833502
2003     0.381511
g1      10.000000
dtype: float64

In [ ]:
frame1.insert(0, "Maximum", frame1.max(axis=1),True)

In [ ]:
frame1

      Maximum  Maximum      Ohio     Texas  California  YYYY1
2001     21.0     21.0  0.665617  0.524226    0.520634   21.0
2002     20.0     20.0  0.669841  0.967749    0.046615   20.0
2003     20.0     20.0  0.069833  0.964553    0.697203   20.0
g        10.0     10.0  0.000000  2.000000    8.000000   10.0
g1        5.0      5.0  2.000000  3.000000    4.000000    5.0

In [ ]:
frame1.iloc[0,3]=-0.99

In [ ]:
frame1.iloc[0:2,:]

    Maximum      Ohio     Texas  California
a  0.963331  0.506692  0.421870   -0.990000
e  0.853255  0.771256  0.731635    0.853255

In [ ]:
frame1=np.abs(frame1)
frame1

      Maximum       Ohio     Texas  California
a    0.963331   0.506692  0.421870    0.990000
e    0.853255   0.771256  0.731635    0.853255
c    0.783262   0.783262  0.287044    0.148891
g    8.000000   0.000000  2.000000    8.000000
g1  10.000000  10.000000  3.000000    4.000000

## set constant values to specified rows/Subtract 2 from first two rows of the data frame

In [ ]:
frame1.iloc[0:2,:]=10

In [ ]:
frame1

      Maximum       Ohio      Texas  California
a   10.000000  10.000000  10.000000   10.000000
e   10.000000  10.000000  10.000000   10.000000
c    0.783262   0.783262   0.287044    0.148891
g    8.000000   0.000000   2.000000    8.000000
g1  10.000000  10.000000   3.000000    4.000000

In [ ]:
frame1.iloc[0:2,:]-=2

In [62]:
frame1

          Ohio     Texas  YYYY1  California
2001  0.165508  0.239298  21.00    0.777634
2003  0.194777  0.459092  20.00    0.060569
2005  0.453358  0.453358  20.00    0.453358
2007  0.000000  2.000000   4.00    6.000000
2009  0.203411  0.787937  16.25    1.822890
2009  0.203411  0.787937  16.25    1.822890
2010  0.203411  0.787937  16.25    1.822890

## Applying user-defined function  on each columm to get difference in max and min values of each column

In [61]:
f = lambda x: x.max() - x.min()
frame1.apply(f)

Ohio           0.453358
Texas          1.760702
YYYY1         17.000000
California     5.939431
dtype: float64

# applying function row-wise

In [ ]:
frame1

           Ohio     Texas  California
2001   0.748526  0.329974    0.028977
2002   0.138956  0.756983    0.212087
2003   0.334746  0.298074    0.041726
2004  10.000000  3.000000    4.000000

In [63]:
frame1.apply(f,axis='columns')

2001    20.834492
2003    19.939431
2005    19.546642
2007     6.000000
2009    16.046589
2009    16.046589
2010    16.046589
dtype: float64

In [ ]:
frame1.apply(f,axis=1)

2001    0.292188
2002    0.174234
2003    0.000000
g1      7.000000
dtype: float64

In [ ]:
frame1.apply(f,axis=0)

Ohio          9.652479
Texas         2.738360
California    3.944667
dtype: float64

## find mean values for each column, by default it is column for data frame

In [ ]:
frame1.mean(axis=0)

Maximum       6.956652
Ohio          5.356652
Texas         4.257409
California    5.629778
dtype: float64

## count values greater than mean of DF for each row and store as a new column

In [65]:
frame1

          Ohio     Texas  YYYY1  California
2001  0.165508  0.239298  21.00    0.777634
2003  0.194777  0.459092  20.00    0.060569
2005  0.453358  0.453358  20.00    0.453358
2007  0.000000  2.000000   4.00    6.000000
2009  0.203411  0.787937  16.25    1.822890
2009  0.203411  0.787937  16.25    1.822890
2010  0.203411  0.787937  16.25    1.822890

In [64]:
frame1.mean().mean()

4.766059478610765

## add all  values of the specified columns

In [ ]:
frame1

         Ohio  California   XXX
a    5.000000    5.000000   2.0
e    5.000000    5.000000   2.0
c    0.570182    0.822164  90.0
g    0.000000    8.000000  10.0
g1  10.000000    2.000000   3.0

In [ ]:
frame1[['Ohio','XXX']].sum(axis=0)

Ohio     20.570182
XXX     107.000000
dtype: float64

In [ ]:
frame1[['Ohio','XXX']].mean(axis=1)

a      3.500000
e      3.500000
c     45.391039
g      5.000000
g1     1.500000
g2     1.500000
dtype: float64

## applied function may also return a series (i.e. multiple values)

In [66]:
def f(x):
    return pd.Series([x.min(), x.max(),x.mean()], index=['min', 'max','avg'])
frame1.apply(f)

         Ohio     Texas  YYYY1  California
min  0.000000  0.239298   4.00    0.060569
max  0.453358  2.000000  21.00    6.000000
avg  0.203411  0.787937  16.25    1.822890

## problem to do: can a lambda function return multiple values?

In [67]:
f1=lambda x: (x.min(),x.max(),x.mean())
f2=frame1.apply(f1)

In [ ]:
type(f2)

pandas.core.frame.DataFrame

## element-wise operation

In [68]:
frame1

          Ohio     Texas  YYYY1  California
2001  0.165508  0.239298  21.00    0.777634
2003  0.194777  0.459092  20.00    0.060569
2005  0.453358  0.453358  20.00    0.453358
2007  0.000000  2.000000   4.00    6.000000
2009  0.203411  0.787937  16.25    1.822890
2009  0.203411  0.787937  16.25    1.822890
2010  0.203411  0.787937  16.25    1.822890

## adding same value  to all elements of DF. What is being added here?

In [219]:
frame1+ frame1.mean().median()

          Ohio     Texas  California        XXX     YYYY1
2001  1.912379       NaN    1.806687  -89.06158  21.93842
2005  1.755696  1.123038    1.576390  -89.06158  20.93842
2004  1.687566  1.687566    1.687566  -89.06158  20.93842
2004  2.436713  2.436713    2.436713 -179.06158  24.93842
2009  1.948089  1.749106    1.876839 -111.56158  22.18842

# using applymap() to apply a specific operation on data elements

In [70]:
f1 = lambda x: np.sqrt(x)+x**2 if (x is not None and x >=0) else 0

In [71]:
s1=pd.Series(range(5))
s1

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [73]:
s1[4]=-90
s1

0     0
1     1
2     2
3     3
4   -90
dtype: int64

## find the output?

In [74]:
s1.apply(f1)

0     0.000000
1     2.000000
2     5.414214
3    10.732051
4     0.000000
dtype: float64

In [75]:
frame1

          Ohio     Texas  YYYY1  California
2001  0.165508  0.239298  21.00    0.777634
2003  0.194777  0.459092  20.00    0.060569
2005  0.453358  0.453358  20.00    0.453358
2007  0.000000  2.000000   4.00    6.000000
2009  0.203411  0.787937  16.25    1.822890
2009  0.203411  0.787937  16.25    1.822890
2010  0.203411  0.787937  16.25    1.822890

## applymap() to apply operation on each elements of a DF

In [76]:
frame1.applymap(f1)

          Ohio     Texas       YYYY1  California
2001  0.434220  0.546444  445.582576    1.486551
2003  0.479273  0.888328  404.472136    0.249775
2005  0.878852  0.878852  404.472136    0.878852
2007  0.000000  5.414214   18.000000   38.449490
2009  0.492387  1.508503  268.093629    4.673073
2009  0.492387  1.508503  268.093629    4.673073
2010  0.492387  1.508503  268.093629    4.673073

In [ ]:
frame1

           Ohio     Texas  California
2001   0.347521  0.261640    0.055333
2002   0.691146  0.659268    0.833502
2003   0.381511  0.381511    0.381511
g1    10.000000  3.000000    4.000000

# sorting

## column names in data frame

In [191]:
frame1

          Ohio     Texas  California
2001  0.110276  0.140662    0.142874
2003  0.599203  0.798026    0.861482
2004  0.799431  0.029354    0.926549
2002  0.799431  0.029354    0.926549

In [187]:
frame1=frame1.append(frame1.loc['2003'])

In [188]:
frame1.index[3]

'2003'

In [189]:
frame1.index=['2001','2003','2004','2002']

In [192]:
frame1.sort_index()

          Ohio     Texas  California
2001  0.110276  0.140662    0.142874
2002  0.799431  0.029354    0.926549
2003  0.599203  0.798026    0.861482
2004  0.799431  0.029354    0.926549

In [193]:
frame1.index.dtype

dtype('O')

In [ ]:
frame1.sort_index(axis=1,ascending=False)

         Texas       Ohio  California
2001  0.261640   0.347521    0.055333
2002  0.659268   0.691146    0.833502
2003  0.381511   0.381511    0.381511
g1    3.000000  10.000000    4.000000

In [194]:
frame1

          Ohio     Texas  California
2001  0.110276  0.140662    0.142874
2003  0.599203  0.798026    0.861482
2004  0.799431  0.029354    0.926549
2002  0.799431  0.029354    0.926549

## sorting on values

In [195]:
frame1.sort_values(by='Ohio')

          Ohio     Texas  California
2001  0.110276  0.140662    0.142874
2003  0.599203  0.798026    0.861482
2004  0.799431  0.029354    0.926549
2002  0.799431  0.029354    0.926549

 ## impact of Nan on sorting, these values are pushed to the end

In [87]:
frame1.iloc[0,1]=None

In [88]:
frame1

          Ohio     Texas  YYYY1  California
2001  0.165508       NaN  21.00    0.777634
2003  0.194777  0.459092  20.00    0.060569
2005  0.453358  0.453358  20.00    0.453358
2007  0.000000  2.000000   4.00    6.000000
2009  0.203411  0.787937  16.25    1.822890
2009  0.203411  0.787937  16.25    1.822890
2010  0.203411  0.787937  16.25    1.822890

In [89]:
frame1.sort_values(by='Texas')

          Ohio     Texas  YYYY1  California
2005  0.453358  0.453358  20.00    0.453358
2003  0.194777  0.459092  20.00    0.060569
2009  0.203411  0.787937  16.25    1.822890
2009  0.203411  0.787937  16.25    1.822890
2010  0.203411  0.787937  16.25    1.822890
2007  0.000000  2.000000   4.00    6.000000
2001  0.165508       NaN  21.00    0.777634

In [174]:
frame1.loc['2003']

Ohio           0.749147
Texas          0.749147
California     0.749147
XXX          -90.000000
Name: 2003, dtype: float64

In [198]:
frame1

          Ohio     Texas  California
2001  0.110276  0.140662    0.142874
2003  0.599203  0.798026    0.861482
2004  0.799431  0.029354    0.926549

## what is happening here?

In [196]:
frame1.drop_duplicates(keep='first',inplace=True)

In [197]:
frame1.loc['2003']*2

Ohio          1.198407
Texas         1.596051
California    1.722964
Name: 2003, dtype: float64

In [181]:
str(int(frame1.index[3])+1)

'2004'

In [ ]:
frame1=frame1.append(frame1.loc['2003']*2)

In [184]:
frame1.rename(index={frame1.index[1]:str(int(frame1.index[3])+1)},inplace=True)
frame1.sort_values(by='Texas')

          Ohio     Texas  California    XXX
2005  0.817277  0.184618    0.637971  -90.0
2004  0.749147  0.749147    0.749147  -90.0
2004  1.498293  1.498293    1.498293 -180.0
2001  0.973959       NaN    0.868268  -90.0

In [74]:
frame1.iloc[len(frame1)-1,1]=1.1

In [199]:
frame1.sort_values(by=['Ohio','Texas'])

          Ohio     Texas  California
2001  0.110276  0.140662    0.142874
2003  0.599203  0.798026    0.861482
2004  0.799431  0.029354    0.926549

# ranking of rows: rank() method returns a rank of every respective element of a series/dataframe passed. The rank is returned on the basis of position after sorting. In case of ties, by default mean is taken as rank

In [200]:
lst_value=list()


for i in range(4):
    lst_value.append('city'+str(i+1))
datavalues = np.random.randint(5, 50, size = 12)

df = pd.DataFrame(datavalues.reshape(3,4), columns = lst_value)

In [201]:
df

   city1  city2  city3  city4
0     18     29     33     15
1     20     19     15     49
2      7     38     41     32

## deafult in data frame is row-wise (axis=0) i.e. for each column, rank() generates rank using mean() for same values

In [202]:
df.rank()

   city1  city2  city3  city4
0    2.0    2.0    2.0    1.0
1    3.0    1.0    1.0    3.0
2    1.0    3.0    3.0    2.0

In [205]:
df

   city1  city2  city3  city4
0     18     29     33     15
1     20     19     15     49
2      7     38     41     32

## rank along axis=1

In [206]:
df.rank(axis=1)

   city1  city2  city3  city4
0    2.0    3.0    4.0    1.0
1    3.0    2.0    1.0    4.0
2    1.0    3.0    4.0    2.0

In [11]:
df.sort_values(ascending=False,by='city1')

   city1  city2  city3  city4
0     46     14     10     42
1     19     34     36     30
2     18     48     31      9

## adding a duplicate row

In [210]:
df.append(df.loc[1]).reset_index()

   index  city1  city2  city3  city4
0      0     18     29     33     15
1      1     20     19     15     49
2      2      7     38     41     32
3      3     20     19     15     49
4      1     20     19     15     49

In [211]:
df=df.append(df.loc[1]).reset_index(drop=True)

In [212]:
df

   city1  city2  city3  city4
0     18     29     33     15
1     20     19     15     49
2      7     38     41     32
3     20     19     15     49
4     20     19     15     49

## Assign different ranks as per apperance of value

## assign max ranks to equal values

In [213]:
df['city1'].rank(method='max')

0    2.0
1    5.0
2    1.0
3    5.0
4    5.0
Name: city1, dtype: float64

## ranking as per apperance of values

In [214]:
d1=df['city1'].rank(method='max')
d2=df['city1'].rank(method='first')
d1.name='rank-max'
d2.name='rank-first'

In [215]:
type(d1)

pandas.core.series.Series

In [216]:
print('columns', "\t" ,'ranks1', "\t" ,'ranks2')
for i in range(len(d1)):
  print("{0:<5} \t\t {1:.1f}\t \t{2:.1f}".format(df.loc[i,"city1"],d1.iloc[i],d2.iloc[i]))

columns 	 ranks1 	 ranks2
18    		 2.0	 	2.0
20    		 5.0	 	3.0
7     		 1.0	 	1.0
20    		 5.0	 	4.0
20    		 5.0	 	5.0

## what is happening here: series are added as row with name of series as row index

## what is difference in following two ways of creating DFs

In [217]:
df3=pd.DataFrame([d2,d1])
display(df3)
display(df3.T)

              0    1    2    3    4
rank-first  2.0  3.0  1.0  4.0  5.0
rank-max    2.0  5.0  1.0  5.0  5.0

   rank-first  rank-max
0         2.0       2.0
1         3.0       5.0
2         1.0       1.0
3         4.0       5.0
4         5.0       5.0

## adding series as columns

In [218]:
df4=pd.DataFrame()
df4['rank-1']=d1
df4['rank-2']=d2
df4

   rank-1  rank-2
0     2.0     2.0
1     5.0     3.0
2     1.0     1.0
3     5.0     4.0
4     5.0     5.0

## problem: create a dataframe having ranking of a data series using different rank method

In [219]:
d3=df['city2'].rank(method='min')
d3

0    4.0
1    1.0
2    5.0
3    1.0
4    1.0
Name: city2, dtype: float64

In [220]:
df4.insert(1,'min-rank',d3)
df4

   rank-1  min-rank  rank-2
0     2.0       4.0     2.0
1     5.0       1.0     3.0
2     1.0       5.0     1.0
3     5.0       1.0     4.0
4     5.0       1.0     5.0

In [41]:
df4['meanrank']=df['city3'].rank(method='average')
df4

   rank-1  min-rank  rank-2  meanrank
0     4.0       1.0     4.0       1.0
1     3.0       2.0     2.0       3.5
2     1.0       4.0     1.0       2.0
3     3.0       2.0     3.0       3.5

## By default, ranks are computed for each column (axis=0) using mean() method. In case ranks are to be computed for each row then use axis=1/columns

In [221]:
df4.rank()

   rank-1  min-rank  rank-2
0     2.0       4.0     2.0
1     4.0       2.0     3.0
2     1.0       5.0     1.0
3     4.0       2.0     4.0
4     4.0       2.0     5.0

In [43]:
df5=df4.rank()
#df5.columns=['X','Y','Z','W']
df5

   rank-1  min-rank  rank-2  meanrank
0     4.0       1.0     4.0       1.0
1     2.5       2.5     2.0       3.5
2     1.0       4.0     1.0       2.0
3     2.5       2.5     3.0       3.5

In [44]:
df5.rank(axis=1,method='max')

   rank-1  min-rank  rank-2  meanrank
0     4.0       2.0     4.0       2.0
1     3.0       3.0     1.0       4.0
2     2.0       4.0     2.0       3.0
3     2.0       2.0     3.0       4.0

## find the output?

In [222]:
dftry = pd.DataFrame(np.random.randn(5, 3)*2, index=['a', 'a', 'b', 'b','c'],columns=['XX','YY','ZZ'])
dftry

         XX        YY        ZZ
a  2.349468  2.846364 -2.660841
a -0.701799  0.134679 -0.873532
b  0.770295 -0.377924 -0.272080
b -0.549826 -1.505777  0.066815
c -1.222552 -4.613605  0.886446

In [223]:
dftry.loc['b']

         XX        YY        ZZ
b  0.770295 -0.377924 -0.272080
b -0.549826 -1.505777  0.066815

## Summarizing and Descriptive Statistics

In [224]:
df

   city1  city2  city3  city4
0     18     29     33     15
1     20     19     15     49
2      7     38     41     32
3     20     19     15     49
4     20     19     15     49

In [225]:
df.loc[1,'city3']=None
df

   city1  city2  city3  city4
0     18     29   33.0     15
1     20     19    NaN     49
2      7     38   41.0     32
3     20     19   15.0     49
4     20     19   15.0     49

## by default Na values are ignored

In [226]:
df.mean(axis=1)

0    23.750000
1    29.333333
2    29.500000
3    25.750000
4    25.750000
dtype: float64

In [50]:
df.mean(axis=1,skipna=False)

0    28.00
1      NaN
2    26.50
3    29.75
dtype: float64

## indirect statistics to get index with min value

In [51]:
df

   city1  city2  city3  city4
0     46     14   10.0     42
1     19     34    NaN     30
2     18     48   31.0      9
3     19     34   36.0     30

In [52]:
df.idxmin()

city1    2
city2    0
city3    0
city4    2
dtype: int64

In [53]:
df['city3'].idxmax()

3

In [54]:
df['city3'].cumsum()

0    10.0
1     NaN
2    41.0
3    77.0
Name: city3, dtype: float64

# Statistical summary of numeric data

In [55]:
df

   city1  city2  city3  city4
0     46     14   10.0     42
1     19     34    NaN     30
2     18     48   31.0      9
3     19     34   36.0     30

In [56]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   city1   4 non-null      int32
 1   city2   4 non-null      int32
 2   city3   3 non-null      float64
 3   city4   4 non-null      int32
dtypes: float64(1), int32(3)
memory usage: 208.0 bytes

In [231]:
df

   city1  city2  city3  city4 newcol
0     18     29   33.0     15      a
1     20     19    NaN     49      b
2      7     38   41.0     32      c
3     20     19   15.0     49      c
4     20     19   15.0     49      b

In [228]:
df.rank()

   city1  city2  city3  city4
0    2.0    4.0    3.0    1.0
1    4.0    2.0    NaN    4.0
2    1.0    5.0    4.0    2.0
3    4.0    2.0    1.5    4.0
4    4.0    2.0    1.5    4.0

## non-numeric columns are ignored in describe

In [229]:
df['newcol']=list('abccb')

In [230]:
df.describe()

           city1    city2      city3      city4
count   5.000000   5.0000   4.000000   5.000000
mean   17.000000  24.8000  26.000000  38.800000
std     5.656854   8.5557  13.114877  15.205262
min     7.000000  19.0000  15.000000  15.000000
25%    18.000000  19.0000  15.000000  32.000000
50%    20.000000  19.0000  24.000000  49.000000
75%    20.000000  29.0000  35.000000  49.000000
max    20.000000  38.0000  41.000000  49.000000

In [232]:
df['newcol'].describe()

count     5
unique    3
top       b
freq      2
Name: newcol, dtype: object

## what is percentile: Used to compare a value with other values in a dataset

How to compute: a)Rank the values in the data set in order from smallest to largest.b) multiply the desired P by N c) round off to nearest integer which gives row index. Use it to get value from the ranked data 3.6=>4

## describe on string data

In [62]:
df.rank()

   city1  city2  city3  city4  newcol
0    4.0    1.0    1.0    4.0     1.0
1    2.5    2.5    NaN    2.5     2.0
2    1.0    4.0    2.0    1.0     3.5
3    2.5    2.5    3.0    2.5     3.5

In [67]:
df.loc[1,'city2']=36

In [65]:
df['simpleRank'] = df.city1.rank()

In [69]:
df['simpleRank2'] = df.city2.rank()

In [70]:
df

   city1  city2  city3  city4 newcol  Percentile Rank  simpleRank  simpleRank2
0     46     14   10.0     42      a            1.000         4.0          1.0
1     19     36    NaN     30      b            0.625         2.5          3.0
2     18     48   31.0      9      c            0.250         1.0          4.0
3     19     34   36.0     30      c            0.625         2.5          2.0

In [71]:
str1=pd.Series(list('axca')*3)
str1

0     a
1     x
2     c
3     a
4     a
5     x
6     c
7     a
8     a
9     x
10    c
11    a
dtype: object

In [72]:
str1.describe()

count     12
unique     3
top        a
freq       6
dtype: object

## Covariance: a statistical function indicates the direction of the linear relationship between variables and is  affected by the change in scale. Simply stated, covariance is a measure of the relationship between two random variables in terms of their  differences

## correlation shows the two variables are related and  measures both the strength and direction of the linear relationship between two variables.

## pairwise correlation of columns
=cov(c1,c2)/std(c1)*std(c2)

where cov(c1,c2)=\sum((c1_i-mean(c1)((c2_i-mean(c2))/N

In [233]:
df.columns

Index(['city1', 'city2', 'city3', 'city4', 'newcol'], dtype='object')

In [234]:
dfcopied=pd.DataFrame()
dfcopied['col1']=df['city1'].sort_values()
dfcopied.reset_index(drop=True,inplace=True)

In [235]:
dfcopied

   col1
0     7
1    18
2    20
3    20
4    20

In [ ]:
dfcopied.drop('col2',axis=1,inplace=True)

In [237]:
dfcopied['col2']=df['city1'].sort_values(ascending=False).reset_index(drop=True)

In [245]:
dfcopied

   col1  col2  col3  col4
0     7    20    20   400
1    18    20    20   200
2    20    20    20    70
3    20    18    18   400
4    20     7     7   -13

In [239]:
dfcopied['col3']=dfcopied['col2']

In [240]:
dfcopied['col4']=dfcopied['col2']-dfcopied['col1']
dfcopied.loc[0,'col4']=100
dfcopied.loc[1,'col4']=200
dfcopied.loc[2,'col4']=70

In [244]:
dfcopied.loc[3,'col4']=400

In [246]:
dfcopied.cov()

        col1    col2    col3      col4
col1   32.00  -11.25  -11.25   -607.25
col2  -11.25   32.00   32.00    635.00
col3  -11.25   32.00   32.00    635.00
col4 -607.25  635.00  635.00  35404.80

In [247]:
dfcopied.corr()

          col1      col2      col3      col4
col1  1.000000 -0.351562 -0.351562 -0.570508
col2 -0.351562  1.000000  1.000000  0.596579
col3 -0.351562  1.000000  1.000000  0.596579
col4 -0.570508  0.596579  0.596579  1.000000

In [156]:
dfcopied.corrwith(dfcopied.loc[:,'col4'])

col1   -0.799416
col2    0.131116
col3    0.131116
col4    1.000000
dtype: float64

In [248]:
dfcopied['col1'].corr(dfcopied['col2'])

-0.35156249999999994

## unique and membership

In [250]:
str1=pd.Series(list('axca')*3)
str1

0     a
1     x
2     c
3     a
4     a
5     x
6     c
7     a
8     a
9     x
10    c
11    a
dtype: object

## extract unique values from a series (not on data frame)

In [251]:
a=str1.unique()
a

array(['a', 'x', 'c'], dtype=object)

In [252]:
str1.value_counts()

a    6
x    3
c    3
dtype: int64

In [159]:
a1=np.random.randint(5,10,size=10)
a1

array([5, 6, 9, 5, 9, 6, 8, 8, 5, 5])

## use sort to get count in a order or not

In [160]:
pd.value_counts(a1,sort=False)

5    4
6    2
8    2
9    2
dtype: int64

In [161]:
df

   city1  city2  city3  city4 newcol  Percentile Rank  simpleRank  simpleRank2
0     46     14   10.0     42      a            1.000         4.0          1.0
1     19     36    NaN     30      b            0.625         2.5          3.0
2     18     48   31.0      9      c            0.250         1.0          4.0
3     19     34   36.0     30      c            0.625         2.5          2.0

In [253]:
df

   city1  city2  city3  city4 newcol
0     18     29   33.0     15      a
1     20     19    NaN     49      b
2      7     38   41.0     32      c
3     20     19   15.0     49      c
4     20     19   15.0     49      b

## membership isin()

In [256]:
mask=df['newcol'].isin(['a','d'])

In [257]:
mask

0     True
1    False
2    False
3    False
4    False
Name: newcol, dtype: bool

## benefit of mask: to retrieve selected elements

In [258]:
dfcopied[mask][['col1','col2']]

   col1  col2
0     7    20

# Problem: given are grades obtained by students in three questions

In [167]:
data = pd.DataFrame({'Qu1': ['A', 'B', 'B', 'C', 'D'],
                     'Qu2': ['A', 'B', 'B', 'D', 'D'],
                     'Qu3': ['B', 'B', 'D', 'D', 'D']})
data

  Qu1 Qu2 Qu3
0   A   A   B
1   B   B   B
2   B   B   D
3   C   D   D
4   D   D   D

## 1. compute count of each grade in a particular qs
## 2. get frequency of each grade for each column

In [259]:
data['Qu2'].value_counts()

B    2
D    2
A    1
Name: Qu2, dtype: int64

## simply using value_counts() with a DF uses existing combination of grades row-wise

In [260]:
data.value_counts()

Qu1  Qu2  Qu3
A    A    B      1
B    B    B      1
          D      1
C    D    D      1
D    D    D      1
dtype: int64

## to get  histogram (frequency) of distinct values in each column

In [261]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
A    1  1.0  0.0
B    2  2.0  2.0
C    1  0.0  0.0
D    1  2.0  3.0

## matching indexed in two data series: to get index value of content in passed series with that of matched series , useful in joining two series or for alignment

In [262]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])
unique_vals = pd.Series(['c', 'b', 'a'])
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [263]:
dfcopied=dfcopied.append(dfcopied.iloc[2]).copy()

In [264]:
dfcopied.index

Int64Index([0, 1, 2, 3, 4, 2], dtype='int64')

In [265]:
I=dfcopied.index.duplicated()
I

array([False, False, False, False, False,  True])

## problem to do:  Generate a data frame with 4 columns and 10 rows. One column is 'Name' of type string and others are named as user-specified and are of Numeric type. Remove duplicate rows. Find correlation between all pairs of attributes which are numeric.
## Create a new data frame having name column along with column having correlation >0.5 with rest of columns

In [ ]:
A B C
AA  AB AC
BA  BB  BC
CA   CB  CC    
AB 0.6
AC  0.7
BC 0.4
  
  AC +BC =.55  C >0.55